# ДОМАШНЕЕ ЗАДАНИЕ 2. ЗАДАЧА 2. 

# Петя и Катя - брат и сестра. Петя студент, а Катя - школьница. 
# Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y, а Катя должна их отгадать. 
# Петя дает Кате две подсказки: он называет ей сумму и произведение этих чисел. 

# Помогите Кате отгадать задуманные Петей числа. 

# Теорема Виета: - 1-й вариант
# Второй вариант (ближе к программистскому) - один цикл for (оптимальный вариант) в диапазоне от 1 до произведения. 
# В нем один if, из которого выходим по break.
# Крутимся в диапазоне до произведения

