# ДОМАШНЯЯ РАБОТА 2. ЗАДАЧА 1. 

# На столе лежат N монеток. Некоторые из них лежат вверх решкой, другие - гербом. 
# Определите, какое минимальное количество монеток, которое нужно перевернуть, 
# чтобы все монетки оказались перевернуты одной и той же стороной. 
# В качестве результата выведите на экран это минимальное количество. 

# Неоптимальный вариант: подсчитываем те и другие и затем берем минимальное количество
# Оптимальный вариант - считаем только одну сторону. 
# Массивы мы еще не проходили

